using System.Collections.Generic;

namespace TestingState
{
    class Tested : ITest
    {
        private static readonly Tested instance = new Tested();
        private List<Question> Questions = new List<Question>(){
            new Question(){
                TitleQuestion = "Тебе грустно?",
                TitleAnswers = new List<string>(){
                    "Мне не грустно",
                    "Я чувствую печаль большую часть времени",
                    "Я все время печален",
                    "Я так печален и несчастлив, что я не могу этого вынести",
                    "test5",
                    "test6"
                },
                
            },
            new Question(){
                TitleQuestion = "Как на счет будущего?",
                
                TitleAnswers = new List<string>(){
                    "Я спокоен за свое будущее",
                    "Я тревожусь о будущем больше обычного",
                    "Я чувствую, что меня ничего не ждет в будущем",
                    "Мое будущее безнадежно и будет еще хуже",
                }
            },
            new Question(){
                TitleQuestion = "Как у тебя с удачей?",
                
                TitleAnswers = new List<string>(){
                    "Я не чувствую себя неудачником",
                    "Я потерпел больше неудач, чем следовало бы",
                    "Когда я оглядываюсь на свою жизнь, я вижу в ней много неудач",
                    "Я чувствую, что как личность я — полный неудачник",
                }
            },
            new Question(){
                TitleQuestion = "Ты получаешь удовольствие от того что делаешь?",
                
                TitleAnswers = new List<string>(){
                    "Я получаю так же много удовольствия от того, чем я всегда наслаждался",
                    "Я не получаю такого же удовольствия, как раньше",
                    "Я получаю совсем немного удовольствия от тех вещей, которыми привык наслаждаться",
                    "Я не получаю никакого удовольствия от того, чем обычно наслаждался",
                }
            },
            new Question(){
                TitleQuestion = "Ты чувствуешь себя виноватым?",
                
                TitleAnswers = new List<string>(){
                    "Я не чувствую себя виноватым в чем-либо",
                    "Я чувствую себя виноватым за многое, что я сделал или должен был бы сделать",
                    "Я чувствую себя виноватым большую часть времени",
                    "Я чувствую себя виноватым все время",
                }
            },
            new Question(){
                TitleQuestion = "Ты Есть ли чувство что тебя надо наказать?",
                
                TitleAnswers = new List<string>(){
                    "Я не чувствую, что могу быть наказанным за что-либо",
                    "Я чувствую, что могу быть наказан за что-либо",
                    "Я ожидаю, что буду наказан",
                    "Я чувствую себя уже наказанным",
                }
            },
            new Question(){
                TitleQuestion = "Как ты относишься к себе?",
                
                TitleAnswers = new List<string>(){
                    "Мое отношение к себе не изменилось",
                    "Я потерял уверенность в себе",
                    "Я разочарован в себе",
                    "Я не люблю себя",
                }
            },
            new Question(){
                TitleQuestion = "Устал, утомился?",
                
                TitleAnswers = new List<string>(){
                    "Я не более уставший или утомленный, чем обычно",
                    "Я устаю или утомляюсь легче, чем обычно",
                    "Я слишком устал и утомлен, чтобы делать многое из привычных для себя вещей",
                    "Я слишком устал и утомлен, чтобы делать большинство привычных дел",
                }
            },
            new Question(){
                TitleQuestion = "Критикуешь или обвиняешь себя?",
                
                TitleAnswers = new List<string>(){
                    "Я критикую или обвиняю себя не больше, чем обычно",
                    "Я более критичен к себе, чем раньше",
                    "Я критикую себя за все свои ошибки",
                    "Я виню себя во всем плохом, что происходит",
                }
            },
            new Question(){
                TitleQuestion = "Есть желание покончить с собой?",
                
                TitleAnswers = new List<string>(){
                    "Я никогда не думал покончить с собой",
                    "У меня есть мысли о том, чтобы покончить с собой, но я этого не сделаю.",
                    "Я хотел бы покончить с собой.",
                    "Я бы убил себя, если бы представился случай.",
                }
            },
            new Question(){
                TitleQuestion = "Может стоит поплакать?",
                
                TitleAnswers = new List<string>(){
                    "Я плачу не больше, чем обычно",
                    "Я плачу больше, чем обычно",
                    "Я плачу по любому незначительному поводу",
                    "Мне хочется плакать, но я уже не могу",
                }
            },
            new Question(){
                TitleQuestion = "Как у тебя с обеспокойством и взволнованостью?",
                
                TitleAnswers = new List<string>(){
                    "Я не более обеспокоен или взволнован, чем обычно",
                    "Я чувствую себя более беспокойно или взволнованно, чем обычно",
                    "Я так взволнован и обеспокоен, что мне трудно оставаться на месте",
                    "Я так взволнован и взвинчен, что мне нужно двигаться или делать хоть что-нибудь",
                }
            },
            new Question(){
                TitleQuestion = "Интересуешься ли ты людьми или делами?",
                
                TitleAnswers = new List<string>(){
                    "Я не утратил интереса к другим людям и делам",
                    "Я меньше интересуюсь другими людьми и делами",
                    "Я практически потерял интерес к другим людям и делам",
                    "Мне тяжело заинтересоваться чем-либо",
                }
            },
            new Question(){
                TitleQuestion = "Принятие решений - не поменялось?",
                
                TitleAnswers = new List<string>(){
                    "Я принимаю решения так же, как всегда",
                    "Принятие решений дается мне труднее, чем обычно",
                    "Мне гораздо труднее, чем раньше, дается принятие решений",
                    "У меня есть проблемы с принятием любых решений",
                }
            },
            new Question(){
                TitleQuestion = "Бесполезен ли ты для общества?",
                
                TitleAnswers = new List<string>(){
                    "Я не чувствую себя бесполезным",
                    "Я не чувствую себя таким же стоящим и полезным, как раньше",
                    "Я чувствую себя менее полезным по сравнению с другими людьми",
                    "Я чувствую себя совершенно никчемным.",
                }
            },
            new Question(){
                TitleQuestion = "Хватает сил и энергии на паставленные задачи?",
                
                TitleAnswers = new List<string>(){
                    "Я энергичен так же, как всегда",
                    "У меня меньше энергии, чем обычно",
                    "Мне не хватает сил на очень многое",
                    "У меня ни на что не хватает сил",
                }
            },
            new Question(){
                TitleQuestion = "Сон - с ним все в порядке?",
                
                TitleAnswers = new List<string>(){
                    "Я не испытываю никаких изменений в шаблоне сна",
                    "Я сплю немного меньше обычного",
                    "Я сплю намного меньше, чем обычно",
                    "Я просыпаюсь через каждый час или два",
                }
            },
            new Question(){
                TitleQuestion = "Раздражает этот мир?",
                
                TitleAnswers = new List<string>(){
                    "Я не более раздражителен, чем обычно",
                    "Я более раздражителен, чем обычно",
                    "Я гораздо более раздражителен, чем обычно",
                    "Я всегда раздражен",
                }
            },
            new Question(){
                TitleQuestion = "Что на счет аппетита?",
                
                TitleAnswers = new List<string>(){
                    "Мой аппетит не изменился",
                    "Я ем немного больше обычного",
                    "Мой аппетит намного больше обычного",
                    "Я все время хочу есть",
                }
            },
            new Question(){
                TitleQuestion = "Так давай сосредоточимся на чем нибудь приятном, можешь?",
                
                TitleAnswers = new List<string>(){
                    " Я могу сосредоточиваться так же хорошо, как всегда",
                    "Я не могу сконцентрироваться так же хорошо, как обычно",
                    "Мне трудно сосредоточиться на чем-то надолго",
                    "Я считаю, что не могу сконцентрироваться ни на чем",
                }
            },
            new Question(){
                TitleQuestion = "Как на счет секса?",
                
                TitleAnswers = new List<string>(){
                    "Я не заметил никаких изменений в своем интересе к сексу",
                    "Секс интересует меня меньше, чем раньше",
                    "Сейчас секс интересует меня гораздо меньше",
                    "Я полностью потерял интерес к сексу",
                }
            }
        };

        private Tested() { }

        public static Tested GetInstance(){
            return instance;
        }

        public List<Question> GetQuestions(){
            return Questions;
        }
    }
}